# Seleksi Kolom Berdasarkan Tipe Data

### Import Modul dan Cek Versi

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan Data Frame

In [3]:
n_rows =5
n_cols=2

cols = ['bil_pecahan','bil_bulat']

df=pd.DataFrame(np.random.randint(1,20, size=(n_rows,n_cols)), columns = cols)

df['bil_pecahan'] =df['bil_pecahan'].astype('float')

df.index = pd.util.testing.makeDateIndex(n_rows, freq= 'H')
df= df.reset_index()

df['teks'] = list('ABCDE')
df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00         16.0         12    A
1 2000-01-01 01:00:00          3.0         18    B
2 2000-01-01 02:00:00         13.0         13    C
3 2000-01-01 03:00:00         16.0         16    D
4 2000-01-01 04:00:00         16.0         12    E

# Memilih Kolom Bertipe Data Numerik

In [4]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         16.0         12
1          3.0         18
2         13.0         13
3         16.0         16
4         16.0         12

# Memilih Kolom Bertipe Data Float

In [6]:
df.select_dtypes(include='float')

   bil_pecahan
0         16.0
1          3.0
2         13.0
3         16.0
4         16.0

# Memilih Kolom Bertipe Data Integer

In [7]:
df.select_dtypes(include='int')

   bil_bulat
0         12
1         18
2         13
3         16
4         12